import { Format, Discipline } from '@/shared/api';

const getDisciplines = (): Discipline[] => [
  {
    discipline_id: 'ba25ddd5-cfc9-496b-9913-2fc1eebc7472',
    name: 'Стратегии формирования навыков',
    module_name: 'Операционные системы',
    rating: 3.02,
    reviews_count: 354,
    likes_count: 25,
    description:
      'Дискретная математика - одна из важнейших составляющих современной математики. С одной стороны, она включает фундаментальные основы математики - теорию множеств, математическую логику, теорию алгоритмов; с другой стороны, является основным математическим аппаратом информатики и вычислительной техники и потому служит базой для многочисленных приложений в экономике, технике, социальной сфере.',
    format: Format.offline,
    presentation_link: 'https://google.com',
    modeus_link: 'https://urfu.modeus.org',
  },
  {
    discipline_id: 'ba25ddd5-cfc9-496b-9913-2fc1eebc7472',
    name: 'Математическая статистика и теория вероятностей (Белоусова)',
    module_name: 'Математическая статистика и теория вероятностей',
    rating: 3.03,
    reviews_count: 2,
    likes_count: 55,
    description:
      'Дискретная математика - одна из важнейших составляющих современной математики. С одной стороны, она включает фундаментальные основы математики - теорию множеств, математическую логику, теорию алгоритмов; с другой стороны, является основным математическим аппаратом информатики и вычислительной техники и потому служит базой для многочисленных приложений в экономике, технике, социальной сфере.',
    format: Format.offline,
    presentation_link: 'https://google.com',
    modeus_link: 'https://urfu.modeus.org',
  },
  {
    discipline_id: 'ba25ddd5-cfc9-496b-9913-2fc1eebc7472',
    name: 'Стратегии формирования навыков',
    module_name: 'Операционные системы',
    rating: 2.51,
    reviews_count: 231,
    likes_count: 1,
    description:
      'Дискретная математика - одна из важнейших составляющих современной математики. С одной стороны, она включает фундаментальные основы математики - теорию множеств, математическую логику, теорию алгоритмов; с другой стороны, является основным математическим аппаратом информатики и вычислительной техники и потому служит базой для многочисленных приложений в экономике, технике, социальной сфере.',
    format: Format.offline,
    presentation_link: 'https://google.com',
    modeus_link: 'https://urfu.modeus.org',
  },
  {
    discipline_id: 'ba25ddd5-cfc9-496b-9913-2fc1eebc7472',
    name: 'Стратегии формирования навыков',
    module_name: 'Операционные системы',
    rating: 3.02,
    reviews_count: 354,
    likes_count: 25,
    description:
      'Дискретная математика - одна из важнейших составляющих современной математики. С одной стороны, она включает фундаментальные основы математики - теорию множеств, математическую логику, теорию алгоритмов; с другой стороны, является основным математическим аппаратом информатики и вычислительной техники и потому служит базой для многочисленных приложений в экономике, технике, социальной сфере.',
    format: Format.offline,
    presentation_link: 'https://google.com',
    modeus_link: 'https://urfu.modeus.org',
  },
  {
    discipline_id: 'ba25ddd5-cfc9-496b-9913-2fc1eebc7472',
    name: 'Математическая статистика и теория вероятностей (Белоусова)',
    module_name: 'Математическая статистика и теория вероятностей',
    rating: 3.03,
    reviews_count: 2,
    likes_count: 55,
    description:
      'Дискретная математика - одна из важнейших составляющих современной математики. С одной стороны, она включает фундаментальные основы математики - теорию множеств, математическую логику, теорию алгоритмов; с другой стороны, является основным математическим аппаратом информатики и вычислительной техники и потому служит базой для многочисленных приложений в экономике, технике, социальной сфере.',
    format: Format.offline,
    presentation_link: 'https://google.com',
    modeus_link: 'https://urfu.modeus.org',
  },
  {
    discipline_id: 'ba25ddd5-cfc9-496b-9913-2fc1eebc7472',
    name: 'Стратегии формирования навыков',
    module_name: 'Операционные системы',
    rating: 2.51,
    reviews_count: 231,
    likes_count: 1,
    description:
      'Дискретная математика - одна из важнейших составляющих современной математики. С одной стороны, она включает фундаментальные основы математики - теорию множеств, математическую логику, теорию алгоритмов; с другой стороны, является основным математическим аппаратом информатики и вычислительной техники и потому служит базой для многочисленных приложений в экономике, технике, социальной сфере.',
    format: Format.offline,
    presentation_link: 'https://google.com',
    modeus_link: 'https://urfu.modeus.org',
  },
  {
    discipline_id: 'ba25ddd5-cfc9-496b-9913-2fc1eebc7472',
    name: 'Стратегии формирования навыков',
    module_name: 'Операционные системы',
    rating: 3.02,
    reviews_count: 354,
    likes_count: 25,
    description:
      'Дискретная математика - одна из важнейших составляющих современной математики. С одной стороны, она включает фундаментальные основы математики - теорию множеств, математическую логику, теорию алгоритмов; с другой стороны, является основным математическим аппаратом информатики и вычислительной техники и потому служит базой для многочисленных приложений в экономике, технике, социальной сфере.',
    format: Format.offline,
    presentation_link: 'https://google.com',
    modeus_link: 'https://urfu.modeus.org',
  },
  {
    discipline_id: 'ba25ddd5-cfc9-496b-9913-2fc1eebc7472',
    name: 'Математическая статистика и теория вероятностей (Белоусова)',
    module_name: 'Математическая статистика и теория вероятностей',
    rating: 3.03,
    reviews_count: 2,
    likes_count: 55,
    description:
      'Дискретная математика - одна из важнейших составляющих современной математики. С одной стороны, она включает фундаментальные основы математики - теорию множеств, математическую логику, теорию алгоритмов; с другой стороны, является основным математическим аппаратом информатики и вычислительной техники и потому служит базой для многочисленных приложений в экономике, технике, социальной сфере.',
    format: Format.offline,
    presentation_link: 'https://google.com',
    modeus_link: 'https://urfu.modeus.org',
  },
  {
    discipline_id: 'ba25ddd5-cfc9-496b-9913-2fc1eebc7472',
    name: 'Стратегии формирования навыков',
    module_name: 'Операционные системы',
    rating: 2.51,
    reviews_count: 231,
    likes_count: 1,
    description:
      'Дискретная математика - одна из важнейших составляющих современной математики. С одной стороны, она включает фундаментальные основы математики - теорию множеств, математическую логику, теорию алгоритмов; с другой стороны, является основным математическим аппаратом информатики и вычислительной техники и потому служит базой для многочисленных приложений в экономике, технике, социальной сфере.',
    format: Format.offline,
    presentation_link: 'https://google.com',
    modeus_link: 'https://urfu.modeus.org',
  },
];

export { getDisciplines };
